{
  "[PAD]": 0,
  "[BOS]": 1,
  "[EOS]": 2,
  "[UNK]": 3,
  "[K_SEP]": 4,
  "[COEFF_R]": 5,
  "[COEFF_I]": 6,
  "IIII": 7,
  "IIIX": 8,
  "IIIY": 9,
  "IIIZ": 10,
  "IIXI": 11,
  "IIXX": 12,
  "IIXY": 13,
  "IIXZ": 14,
  "IIYI": 15,
  "IIYX": 16,
  "IIYY": 17,
  "IIYZ": 18,
  "IIZI": 19,
  "IIZX": 20,
  "IIZY": 21,
  "IIZZ": 22,
  "IXII": 23,
  "IXIX": 24,
  "IXIY": 25,
  "IXIZ": 26,
  "IXXI": 27,
  "IXXX": 28,
  "IXXY": 29,
  "IXXZ": 30,
  "IXYI": 31,
  "IXYX": 32,
  "IXYY": 33,
  "IXYZ": 34,
  "IXZI": 35,
  "IXZX": 36,
  "IXZY": 37,
  "IXZZ": 38,
  "IYII": 39,
  "IYIX": 40,
  "IYIY": 41,
  "IYIZ": 42,
  "IYXI": 43,
  "IYXX": 44,
  "IYXY": 45,
  "IYXZ": 46,
  "IYYI": 47,
  "IYYX": 48,
  "IYYY": 49,
  "IYYZ": 50,
  "IYZI": 51,
  "IYZX": 52,
  "IYZY": 53,
  "IYZZ": 54,
  "IZII": 55,
  "IZIX": 56,
  "IZIY": 57,
  "IZIZ": 58,
  "IZXI": 59,
  "IZXX": 60,
  "IZXY": 61,
  "IZXZ": 62,
  "IZYI": 63,
  "IZYX": 64,
  "IZYY": 65,
  "IZYZ": 66,
  "IZZI": 67,
  "IZZX": 68,
  "IZZY": 69,
  "IZZZ": 70,
  "XIII": 71,
  "XIIX": 72,
  "XIIY": 73,
  "XIIZ": 74,
  "XIXI": 75,
  "XIXX": 76,
  "XIXY": 77,
  "XIXZ": 78,
  "XIYI": 79,
  "XIYX": 80,
  "XIYY": 81,
  "XIYZ": 82,
  "XIZI": 83,
  "XIZX": 84,
  "XIZY": 85,
  "XIZZ": 86,
  "XXII": 87,
  "XXIX": 88,
  "XXIY": 89,
  "XXIZ": 90,
  "XXXI": 91,
  "XXXX": 92,
  "XXXY": 93,
  "XXXZ": 94,
  "XXYI": 95,
  "XXYX": 96,
  "XXYY": 97,
  "XXYZ": 98,
  "XXZI": 99,
  "XXZX": 100,
  "XXZY": 101,
  "XXZZ": 102,
  "XYII": 103,
  "XYIX": 104,
  "XYIY": 105,
  "XYIZ": 106,
  "XYXI": 107,
  "XYXX": 108,
  "XYXY": 109,
  "XYXZ": 110,
  "XYYI": 111,
  "XYYX": 112,
  "XYYY": 113,
  "XYYZ": 114,
  "XYZI": 115,
  "XYZX": 116,
  "XYZY": 117,
  "XYZZ": 118,
  "XZII": 119,
  "XZIX": 120,
  "XZIY": 121,
  "XZIZ": 122,
  "XZXI": 123,
  "XZXX": 124,
  "XZXY": 125,
  "XZXZ": 126,
  "XZYI": 127,
  "XZYX": 128,
  "XZYY": 129,
  "XZYZ": 130,
  "XZZI": 131,
  "XZZX": 132,
  "XZZY": 133,
  "XZZZ": 134,
  "YIII": 135,
  "YIIX": 136,
  "YIIY": 137,
  "YIIZ": 138,
  "YIXI": 139,
  "YIXX": 140,
  "YIXY": 141,
  "YIXZ": 142,
  "YIYI": 143,
  "YIYX": 144,
  "YIYY": 145,
  "YIYZ": 146,
  "YIZI": 147,
  "YIZX": 148,
  "YIZY": 149,
  "YIZZ": 150,
  "YXII": 151,
  "YXIX": 152,
  "YXIY": 153,
  "YXIZ": 154,
  "YXXI": 155,
  "YXXX": 156,
  "YXXY": 157,
  "YXXZ": 158,
  "YXYI": 159,
  "YXYX": 160,
  "YXYY": 161,
  "YXYZ": 162,
  "YXZI": 163,
  "YXZX": 164,
  "YXZY": 165,
  "YXZZ": 166,
  "YYII": 167,
  "YYIX": 168,
  "YYIY": 169,
  "YYIZ": 170,
  "YYXI": 171,
  "YYXX": 172,
  "YYXY": 173,
  "YYXZ": 174,
  "YYYI": 175,
  "YYYX": 176,
  "YYYY": 177,
  "YYYZ": 178,
  "YYZI": 179,
  "YYZX": 180,
  "YYZY": 181,
  "YYZZ": 182,
  "YZII": 183,
  "YZIX": 184,
  "YZIY": 185,
  "YZIZ": 186,
  "YZXI": 187,
  "YZXX": 188,
  "YZXY": 189,
  "YZXZ": 190,
  "YZYI": 191,
  "YZYX": 192,
  "YZYY": 193,
  "YZYZ": 194,
  "YZZI": 195,
  "YZZX": 196,
  "YZZY": 197,
  "YZZZ": 198,
  "ZIII": 199,
  "ZIIX": 200,
  "ZIIY": 201,
  "ZIIZ": 202,
  "ZIXI": 203,
  "ZIXX": 204,
  "ZIXY": 205,
  "ZIXZ": 206,
  "ZIYI": 207,
  "ZIYX": 208,
  "ZIYY": 209,
  "ZIYZ": 210,
  "ZIZI": 211,
  "ZIZX": 212,
  "ZIZY": 213,
  "ZIZZ": 214,
  "ZXII": 215,
  "ZXIX": 216,
  "ZXIY": 217,
  "ZXIZ": 218,
  "ZXXI": 219,
  "ZXXX": 220,
  "ZXXY": 221,
  "ZXXZ": 222,
  "ZXYI": 223,
  "ZXYX": 224,
  "ZXYY": 225,
  "ZXYZ": 226,
  "ZXZI": 227,
  "ZXZX": 228,
  "ZXZY": 229,
  "ZXZZ": 230,
  "ZYII": 231,
  "ZYIX": 232,
  "ZYIY": 233,
  "ZYIZ": 234,
  "ZYXI": 235,
  "ZYXX": 236,
  "ZYXY": 237,
  "ZYXZ": 238,
  "ZYYI": 239,
  "ZYYX": 240,
  "ZYYY": 241,
  "ZYYZ": 242,
  "ZYZI": 243,
  "ZYZX": 244,
  "ZYZY": 245,
  "ZYZZ": 246,
  "ZZII": 247,
  "ZZIX": 248,
  "ZZIY": 249,
  "ZZIZ": 250,
  "ZZXI": 251,
  "ZZXX": 252,
  "ZZXY": 253,
  "ZZXZ": 254,
  "ZZYI": 255,
  "ZZYX": 256,
  "ZZYY": 257,
  "ZZYZ": 258,
  "ZZZI": 259,
  "ZZZX": 260,
  "ZZZY": 261,
  "ZZZZ": 262,
  "C:-1.00": 263,
  "C:-0.95": 264,
  "C:-0.90": 265,
  "C:-0.85": 266,
  "C:-0.80": 267,
  "C:-0.75": 268,
  "C:-0.70": 269,
  "C:-0.65": 270,
  "C:-0.60": 271,
  "C:-0.55": 272,
  "C:-0.50": 273,
  "C:-0.45": 274,
  "C:-0.40": 275,
  "C:-0.35": 276,
  "C:-0.30": 277,
  "C:-0.25": 278,
  "C:-0.20": 279,
  "C:-0.15": 280,
  "C:-0.10": 281,
  "C:-0.05": 282,
  "C:+0.00": 283,
  "C:+0.05": 284,
  "C:+0.10": 285,
  "C:+0.15": 286,
  "C:+0.20": 287,
  "C:+0.25": 288,
  "C:+0.30": 289,
  "C:+0.35": 290,
  "C:+0.40": 291,
  "C:+0.45": 292,
  "C:+0.50": 293,
  "C:+0.55": 294,
  "C:+0.60": 295,
  "C:+0.65": 296,
  "C:+0.70": 297,
  "C:+0.75": 298,
  "C:+0.80": 299,
  "C:+0.85": 300,
  "C:+0.90": 301,
  "C:+0.95": 302,
  "C:+1.00": 303
}